Revit 2024 API
ClosestPointsPairBetweenTwoCurves Class
 This class captures results of computation of closest points between two generic curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public class ClosestPointsPairBetweenTwoCurves : IDisposable
Visual Basic
Public Class ClosestPointsPairBetweenTwoCurves _
	Implements IDisposable
Visual C++
public ref class ClosestPointsPairBetweenTwoCurves : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves
See Also
ClosestPointsPairBetweenTwoCurves Members
Autodesk.Revit.DB Namespace